/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   main.c                                             :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: abergman <abergman@student.42.fr>          +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2025/06/14 15:05:08 by abergman          #+#    #+#             */
/*   Updated: 2025/06/14 22:56:50 by abergman         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include <avr/io.h>
#include <util/delay.h>

int main(void)
{
    DDRB |= (1 << PB0) | (1 << PB1) | (1 << PB2);          // PB0 (D8) как выход для светодиода
    DDRD &= ~(1 << PD2);         // PD2 (D2) как вход для кнопки
    PORTD |= (1 << PD2);         // Включаем подтягивающий резистор на PD2

    while(1)
    {
        if (!((PIND >> PD2) & 1)) // Проверяем, нажата ли кнопка (PD2 = 0)
        {
            // PORTB &= ~(1 << PB0); // Выключаем светодиод
            PORTB ^= (1 << PB0);  // Инверсия бита
            _delay_ms(50);        // Задержка для подавления дребезга
        }
        else
        {
            PORTB ^= (1 << PB2);  // Включаем светодиод
            _delay_ms(100);
        }
        PORTB |= (1 << PB1);  // Включаем светодиод
    }
    return 0;
}
